#include    "ep1m.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
EP1m::EP1m(QObject *parent) : Vehicle (parent)
  , tumblers_panel(Q_NULLPTR)
  , msud(Q_NULLPTR)
  , Ucc(0.0)
  , battery(Q_NULLPTR)
  , power_supply(Q_NULLPTR)
  , Icc(0.0)
  , trac_trans(Q_NULLPTR)
  , main_switch(Q_NULLPTR)
  , Ukr(0.0)
  , km5(Q_NULLPTR)
  , safety_valve(Q_NULLPTR)
  , kv44(Q_NULLPTR)
  , kv39(Q_NULLPTR)
  , km(Q_NULLPTR)
{
    Uks = 25000.0;
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
EP1m::~EP1m()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void EP1m::initialization()
{
    // Инициализация питания цепей управления
    initControlPower();

    // Инициализация цепей управления
    initControlCircuit();

    // Инициализация АЗВ
    initAZV();

    // Инициализация пульта управления в кабине
    initPanel();

    // Инициализация микропроцессорной системы управления и диагностики (МСУД)
    initMSUD();

    // Инициализация силовой схемы
    initPowerCircuit();

    // Инициализация озвучки
    initSounds();
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void EP1m::step(double t, double dt)
{
    // Работа подсистемы питания цепей управления
    stepControlPower(t, dt);

    // Работа цепей управления
    stepControlCircuit(t, dt);

    // Работа приборов управления в кабине
    stepPanel(t, dt);

    // Работа микропроцессорной системы управления и диагностики
    stepMSUD(t, dt);

    // Работа силовой схемы
    stepPowerCircuit(t, dt);

    // Вывод сигналов к внешней модели
    signalsOutput();

    // Отладочный вывод
    stepDebugPrint(t, dt);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
GET_VEHICLE(EP1m)
