//-----------------------------------------------------------------------------
//
//      Общая структура для приёма данных от сервера
//      (c) РГУПС, ВЖД 03/09/2022
//      Разработал: Даглдиян Б.Д.
//
//-----------------------------------------------------------------------------
/*!
 * \file
 * \brief Общая структура для приёма данных от сервера
 * \copyright РГУПС, ВЖД
 * \author Даглдиян Б.Д.
 * \date 03/09/2022
 */

#ifndef STRUCTURES_CLUB_U_H
#define STRUCTURES_CLUB_U_H


#include <QMetaType>

//-----------------------------------------------------------------------------
//  Структура для приёма данных с сервера
//-----------------------------------------------------------------------------
#pragma pack(push, 1)
struct structs_CLUB_U_t
{
    bool            wasSendData; ///< были ли отправленны данные с сервера


    structs_CLUB_U_t()
    {
        wasSendData = false;
    }

};
#pragma pack(pop)



//
Q_DECLARE_METATYPE(structs_CLUB_U_t)



#endif // STRUCTURES_CLUB_U_H
